Repository: IvanK04/Diet-Tracking-Project-Finalist-Hutech-IT-Got-Talent
Catalog: lib/l10n/app_*.arb
Languages: vi

# bottomNavAddFood
source: Add Food
vi: Thêm món ăn

# addFoodPageTitle
source: Add Food
vi: Thêm món ăn

# addFoodNameLabel
source: Food name
vi: Tên món ăn

# addFoodSaveButton
source: Save Food
vi: Lưu món ăn

# addFoodEmptyValidator
source: Please enter this information
vi: Vui lòng nhập thông tin

source: Define your goal
vi: Xác định mục tiêu của bạn

# recordSuccessMessage
source: Food record saved successfully!
vi: Món ăn đã được ghi nhận thành công!

# addFoodSuccessNotificationTitle
source: Food Added Successfully
vi: Thêm món ăn thành công

# addFoodSuccessNotificationBody
source: You have added '{foodName}' on {date}.
vi: Bạn đã thêm '{foodName}' vào ngày {date}.

# weWillBuild
source: We'll build a tailored plan to keep you motivated and help you reach your goals.
vi: Chúng tôi sẽ xây dựng cho bạn một kế hoạch tùy chỉnh nhằm giúp bạn duy trì động lực và đạt được mục tiêu của mình.

# getStartedNow
source: Get started!
vi: Bắt đầu ngay!

# appTitle
source: Diet Tracking
vi: Theo dõi chế độ ăn

# nutrientFat
source: Fat
vi: Chất béo

# startTrackingToday
source: Start tracking your diet plan today!
vi: Bắt đầu theo dõi chế độ ăn kiêng của bạn hôm nay!

# trackDailyDiet
source: Track your daily diet with personalized meal plans and smart recommendations.
vi: Theo dõi chế độ ăn kiêng hàng ngày với kế hoạch bữa ăn cá nhân hóa và khuyến nghị thông minh.

source: Get started
vi: Bắt đầu ngay

source: Login
vi: Đăng nhập

source: Apply
vi: Áp dụng

source: Tell us about yourself
vi: Hãy cho chúng tôi biết về bản thân bạn

# weWillCreatePersonalizedPlan
source: We'll create a personalized plan for you based on details like your age and current weight.
vi: Chúng tôi sẽ tạo kế hoạch cá nhân hóa cho bạn dựa trên các chi tiết như tuổi và cân nặng hiện tại của bạn.

# chatBotYesterday
source: Yesterday
vi: Hôm qua

# chatBotConfirmDeleteTitle
source: Delete session?
vi: Xóa cuộc trò chuyện?

# chatBotConfirmDeleteMessage
source: Are you sure you want to delete the session "{sessionTitle}"?
vi: Bạn có chắc chắn muốn xóa cuộc trò chuyện "{sessionTitle}"?

# chatBotSessionDeleted
source: Session deleted
vi: Đã xóa cuộc trò chuyện

# chatBotHistoryEmpty
source: No chat history yet
vi: Chưa có lịch sử trò chuyện

# chatBotStartConversation
source: Start a conversation...
vi: Bắt đầu cuộc trò chuyện...

# chatBotEmptyTitle
source: Start a new conversation
vi: Bắt đầu cuộc trò chuyện mới

# chatBotEmptySubtitle
source: Your chat history will be saved here. Ask me anything about your diet plan!
vi: Lịch sử trò chuyện của bạn sẽ được lưu tại đây. Hãy hỏi tôi bất cứ điều gì về kế hoạch ăn kiêng của bạn!

# chatBotChatHistory
source: Chat history
vi: Lịch sử chat

# chatBotCreateNewChat
source: Create new chat
vi: Tạo đoạn chat mới

source: Start
vi: Bắt đầu

source: Gender
vi: Giới tính

# weWillUseThisInfo
source: We'll use this information to calculate your daily energy needs.
vi: Chúng tôi sẽ sử dụng thông tin này để tính toán nhu cầu năng lượng hằng ngày của bạn.

source: Male
vi: Nam

source: Female
vi: Nữ

# continueButton
source: Continue
vi: Tiếp tục

source: Age
vi: Tuổi

source: How old are you?
vi: Bạn bao nhiêu tuổi?

source: Next
vi: Tiếp theo

# chooseYourDietStyle
source: Which plan do you prefer?
vi: Bạn muốn theo chế độ nào?

# youCanChangeLater
source: You can change this later in Settings.
vi: Bạn có thể thay đổi sau trong cài đặt.

# ketoDescription
source: Very low carb, higher fat.
vi: Giảm carb mạnh, tăng chất béo.

source: Normal weight loss
vi: Giảm cân bình thường

# normalWeightLossDescription
source: Balanced carbs, protein, and fat. Easy to maintain.
vi: Cân bằng carb, đạm, béo. Dễ duy trì lâu dài.

# lowCarbsDescription
source: Moderately reduced carbs, easier to sustain.
vi: Giảm carb vừa phải, dễ duy trì.

source: What is your main goal?
vi: Mục tiêu chính của bạn là gì?

source: Skip
vi: Bỏ qua

source: Lose weight
vi: Giảm cân

source: Maintain weight
vi: Duy trì cân nặng

source: Gain weight
vi: Tăng cân

source: Build muscle
vi: Tăng cơ

source: Improve fitness
vi: Cải thiện thể lực

source: Eat healthy
vi: Ăn uống lành mạnh

source: Reduce stress
vi: Giảm stress

source: Lose belly fat
vi: Giảm mỡ bụng

source: Why do you want to lose weight?
vi: Tại sao bạn muốn giảm cân?

source: Why do you want to gain weight?
vi: Tại sao bạn muốn tăng cân?

source: Why do you want to maintain weight?
vi: Tại sao bạn muốn duy trì cân nặng?

source: Why do you want to build muscle?
vi: Tại sao bạn muốn tăng cơ?

source: Why did you choose this goal?
vi: Tại sao bạn chọn mục tiêu này?

source: Improve health
vi: Cải thiện sức khỏe

source: Feel more confident
vi: Cảm thấy tự tin hơn

source: Increase confidence
vi: Tăng tự tin

source: Fit into clothes
vi: Mặc vừa quần áo

source: More energy
vi: Nhiều năng lượng hơn

# prepareForEvent
source: Prepare for an event
vi: Chuẩn bị cho một sự kiện

source: Reduce visceral fat
vi: Giảm mỡ nội tạng

source: Improve physical fitness
vi: Cải thiện thể lực

source: Improve appearance
vi: Cải thiện ngoại hình

# doctorRecommendation
source: Doctor's recommendation
vi: Theo khuyến nghị của bác sĩ

source: Healthy lifestyle
vi: Lối sống lành mạnh

source: Build strength
vi: Tăng sức mạnh

source: Improve athletics
vi: Cải thiện thể thao

source: Look more muscular
vi: Trông cơ bắp hơn

source: Recover from illness
vi: Hồi phục sau bệnh

source: Increase appetite
vi: Tăng cảm giác thèm ăn

source: Stay healthy
vi: Giữ sức khỏe

source: Prevent weight gain
vi: Ngăn tăng cân

source: Balanced lifestyle
vi: Lối sống cân bằng

source: Maintain fitness
vi: Duy trì thể lực

source: Get stronger
vi: Trở nên mạnh mẽ hơn

source: Improve body composition
vi: Cải thiện thành phần cơ thể

source: Athletic performance
vi: Hiệu suất thể thao

source: Look toned
vi: Trông săn chắc

source: Boost metabolism
vi: Tăng cường trao đổi chất

source: Other
vi: Khác

source: What brought you to us?
vi: Điều gì đã đưa bạn đến với chúng tôi?

# findSuitableMealPlan
source: Find a suitable meal plan
vi: Tìm kiếm kế hoạch ăn phù hợp

source: Want to build good habits
vi: Muốn xây thói quen tốt

source: Lack time to cook
vi: Thiếu thời gian nấu ăn

source: Improve work performance
vi: Cải thiện hiệu suất làm việc

source: Poor sleep
vi: Ngủ không ngon

source: Care about heart health
vi: Quan tâm sức khỏe tim mạch

source: Poor health indicators
vi: Chỉ số sức khỏe chưa tốt

source: Optimize meal costs
vi: Muốn tối ưu chi phí bữa ăn

# weBringYouBestResults
source: We bring you the best results
vi: Chúng tôi mang đến cho bạn hiệu quả tốt nhất

# personalizedPathwayBasedOnGoals
source: Personalized pathway based on your goals and habits. Start now to see sustainable change.
vi: Lộ trình cá nhân hóa dựa trên mục tiêu và thói quen của bạn. Bắt đầu ngay để thấy sự thay đổi bền vững.

source: Height
vi: Chiều cao

source: What is your height?
vi: Chiều cao của bạn là bao nhiêu?

source: Weight
vi: Cân nặng

source: What is your weight?
vi: Cân nặng của bạn là bao nhiêu?

source: Goal Weight
vi: Cân nặng mục tiêu

# whatIsYourGoalWeight
source: What weight do you want to achieve?
vi: Bạn muốn đạt cân nặng bao nhiêu?

source: Done
vi: Xong

source: You can do it!
vi: Bạn sẽ làm được!

# maintainCurrentWeightIsHealthy
source: Maintaining your current weight is a healthy choice
vi: Duy trì cân nặng hiện tại là một lựa chọn lành mạnh

# loseWeightGoalPrefix
source: Losing
vi: Giảm

# loseWeightGoalSuffix
source: kg is a challenging but completely achievable goal
vi: kg là mục tiêu thách thức nhưng hoàn toàn khả thi

# gainWeightGoalPrefix
source: Gaining
vi: Tăng

# gainWeightGoalSuffix
source: kg will help you achieve better balance
vi: kg sẽ giúp bạn đạt trạng thái cân bằng tốt hơn

# setClearGoalsMessage
source: Setting clear goals helps you get closer every day
vi: Đặt mục tiêu rõ ràng giúp bạn tiến gần hơn mỗi ngày

# goalWeightPrefix
source: Goal weight
vi: Cân nặng mục tiêu

# userProgressMessage
source: users report clear progress after 4 weeks on the plan
vi: người dùng ghi nhận tiến bộ rõ rệt sau 4 tuần theo kế hoạch

source: Continue as Guest
vi: Tiếp tục với Guest

source: Sign Up Account
vi: Đăng Ký Tài Khoản

source: Choose your language
vi: Chọn ngôn ngữ của bạn

source: Language changed successfully!
vi: Đã thay đổi ngôn ngữ thành công!

source: Language changed to Vietnamese
vi: Đã chuyển sang tiếng Việt

source: Language changed to English
vi: Đã chuyển sang tiếng Anh

# bmiCurrentTitle
source: Current BMI
vi: Chỉ số BMI hiện tại

# bmiEnterHeightToCalculate
source: Please enter height to calculate BMI.
vi: Hãy nhập chiều cao để tính BMI.

# bmiUnderweight
source: You are underweight.
vi: Bạn đang thiếu cân.

# bmiNormal
source: You have a normal weight.
vi: Bạn có cân nặng bình thường.

# bmiOverweight
source: You are overweight.
vi: Bạn đang thừa cân.

# bmiObese
source: You need to lose weight seriously to protect your health.
vi: Bạn cần giảm cân nghiêm túc để bảo vệ sức khỏe

# activityLevelSedentaryTitle
source: Sedentary
vi: Ít vận động

# activityLevelSedentarySubtitle
source: (Mostly sitting, little or no exercise)
vi: (Chủ yếu ngồi, ít hoặc không tập thể dục)

# activityLevelLightlyActiveTitle
source: Lightly active
vi: Vận động nhẹ

# activityLevelLightlyActiveSubtitle
source: (Exercise/sports 1-3 days/week)
vi: (Tập thể dục/thể thao 1-3 ngày/tuần)

# activityLevelModeratelyActiveTitle
source: Moderately active
vi: Vận động vừa

# activityLevelModeratelyActiveSubtitle
source: (Exercise/sports 3-5 days/week)
vi: (Tập thể dục/thể thao 3-5 ngày/tuần)

# dateRangeTitle
source: Date range
vi: Khoảng ngày

source: Today
vi: Hôm nay

source: Yesterday
vi: Hôm qua

source: Last 7 days
vi: 7 ngày qua

source: Custom range
vi: Khoảng khác

# activityLevelVeryActiveTitle
source: Very active
vi: Vận động nặng

# activityLevelVeryActiveSubtitle
source: (Exercise/sports 6-7 days/week)
vi: (Tập thể dục/thể thao 6-7 ngày/tuần)

# activityLevelExtraActiveTitle
source: Extra active
vi: Vận động rất nặng

# activityLevelExtraActiveSubtitle
source: (Exercise twice a day, manual labor)
vi: (Tập thể dục 2 lần/ngày, công việc lao động phổ thông)

# loginTitle
source: Login
vi: Đăng Nhập

# emailOrPhone
source: Email or Phone Number
vi: Email hoặc Số Điện Thoại

# emailOrPhoneHint
source: Enter Email or Phone Number
vi: Nhập Email hoặc Số Điện Thoại

source: Password
vi: Mật khẩu

source: Forgot password?
vi: Quên mật khẩu?

# loginButton
source: Login
vi: Đăng nhập

source: OR login with
vi: HOẶC đăng nhập bằng

source: Continue with Google
vi: Tiếp tục với Google

# dontHaveAccount
source: I don't have an account
vi: Tôi chưa có tài khoản

source: Please enter email
vi: Vui lòng nhập email

source: Please enter password
vi: Vui lòng nhập mật khẩu

# loginSuccess
source: Login successful!
vi: Đăng nhập thành công!

# loginFailed
source: Login failed. Please check your information.
vi: Đăng nhập thất bại. Vui lòng kiểm tra lại thông tin.

# invalidCredentials
source: Email or password is incorrect. Please try again.
vi: Email hoặc mật khẩu không chính xác. Vui lòng thử lại.

# googleLoginSuccess
source: Google login successful!
vi: Đăng nhập Google thành công!

source: Google login cancelled.
vi: Đăng nhập Google đã bị hủy.

# googleLoginFailed
source: Google login failed. Please try again.
vi: Đăng nhập Google thất bại. Vui lòng thử lại.

# passwordResetEmailSent
source: Password reset email sent. Please check your inbox.
vi: Đã gửi email đặt lại mật khẩu. Vui lòng kiểm tra hộp thư.

source: Please enter email first.
vi: Vui lòng nhập email trước.

# passwordResetFailed
source: Unable to send password reset email. Please check your email and try again.
vi: Không thể gửi email đặt lại mật khẩu. Vui lòng kiểm tra email và thử lại.

# signupTitle
source: Create Account
vi: Tạo tài khoản

source: Full Name
vi: Họ và tên

# fullNameHint
source: Enter your full name
vi: Nhập họ và tên của bạn

source: Phone Number
vi: Số điện thoại

# phoneNumberHint
source: Enter phone number
vi: Nhập số điện thoại

source: Confirm Password
vi: Nhập lại mật khẩu

# agreeWith
source: I agree with
vi: Tôi đồng ý với

source: Terms of Service
vi: Điều khoản sử dụng

source: and
vi: và

source: Privacy Policy
vi: Chính sách bảo mật

# signupButton
source: Sign Up
vi: Đăng ký

# alreadyHaveAccount
source: Already have an account?
vi: Đã có tài khoản?

# loginLink
source: Login
vi: Đăng nhập

# forgotPasswordTitle
source: Forgot Password?
vi: Quên mật khẩu?

# forgotPasswordInstruction
source: Enter your email and we'll send you instructions to reset your password.
vi: Nhập email của bạn và chúng tôi sẽ gửi cho bạn hướng dẫn để đặt lại mật khẩu.

source: Send Reset Email
vi: Gửi email đặt lại mật khẩu

source: Back to Login
vi: Quay lại đăng nhập

source: Success
vi: Thành công

source: Invalid email.
vi: Email không hợp lệ.

# pleaseEnterValidEmail
source: Please enter email.
vi: Vui lòng nhập email.

# emailNotExist
source: Email does not exist in the system.
vi: Email không tồn tại trong hệ thống.

# accountUsesProviderMessage
source: This account uses: {provider}. Cannot reset password via email.
vi: Tài khoản này đang đăng nhập bằng: {provider}. Không thể đặt lại mật khẩu bằng email.

# unableToSendResetEmail
source: Unable to send password reset email. Please try again later.
vi: Không thể gửi email đặt lại mật khẩu. Vui lòng thử lại sau.

# userNotFound
source: No account found with this email.
vi: Không tìm thấy tài khoản với email này.

# tooManyRequests
source: Too many requests. Please try again later.
vi: Quá nhiều yêu cầu. Vui lòng thử lại sau.

# networkError
source: Network error. Please check your connection and try again.
vi: Lỗi kết nối mạng. Vui lòng kiểm tra kết nối và thử lại.

# pleaseEnterFullName
source: Please enter your full name.
vi: Vui lòng nhập họ và tên.

source: Please enter phone number.
vi: Vui lòng nhập số điện thoại.

# passwordMinLength
source: Password must be at least 6 characters.
vi: Mật khẩu phải có ít nhất 6 ký tự.

source: Please confirm password.
vi: Vui lòng nhập lại mật khẩu.

source: Passwords do not match.
vi: Mật khẩu xác nhận không khớp.

# pleaseAgreeToTerms
source: Please agree to the terms of service.
vi: Vui lòng đồng ý với điều khoản sử dụng.

# emailAlreadyInUse
source: Email is already in use. Please use a different email.
vi: Email đã được sử dụng. Vui lòng sử dụng email khác.

# weakPassword
source: Password is too weak. Please use a stronger password.
vi: Mật khẩu quá yếu. Vui lòng sử dụng mật khẩu mạnh hơn.

# registrationFailed
source: Registration failed. Please try again.
vi: Đăng ký thất bại. Vui lòng thử lại.

# registrationSuccess
source: Registration successful!
vi: Đăng ký thành công!

# chatBotDietAssistant
source: Diet Assistant
vi: Trợ lý dinh dưỡng

# chatBotNewChatCreated
source: New conversation created
vi: Đã tạo cuộc trò chuyện mới

# chatBotChatHistoryComingSoon
source: Chat history feature will be added later
vi: Tính năng lịch sử chat sẽ được thêm sau

# chatBotSettingsComingSoon
source: Settings feature will be added later
vi: Tính năng cài đặt sẽ được thêm sau

# chatBotPleaseEnterAllInfo
source: Please fill in all information
vi: Vui lòng điền đầy đủ thông tin

# chatBotStartNewConversation
source: Start a new conversation
vi: Bắt đầu cuộc trò chuyện mới

# chatBotViewPreviousConversations
source: View previous conversations
vi: Xem các cuộc trò chuyện trước

# chatBotSettings
source: Settings
vi: Cài đặt

# chatBotCustomizeApp
source: Customize app
vi: Tùy chỉnh ứng dụng

# chatBotEnterMessage
source: Enter message...
vi: Nhập tin nhắn...

# chatBotFoodSuggestion
source: food suggestion
vi: gợi ý món ăn

# chatBotEnterIngredients
source: Enter available ingredients
vi: Nhập nguyên liệu món ăn đang có sẵn

# chatBotEnterBudget
source: Enter desired meal budget
vi: Nhập chi phí mong muốn cho bữa ăn

# chatBotEnterMealType
source: Breakfast, Lunch, Dinner, Snack, Full day menu
vi: Bữa sáng, Bữa trưa, Bữa tối, Bữa ăn nhẹ, Thực đơn cả ngày

# chatBotSubmit
source: Submit
vi: Gửi

# chatBotJustNow
source: Just now
vi: Vừa xong

# chatBotMinutesAgo
source: {minutes} minutes ago
vi: {minutes} phút trước

# chatBotHoursAgo
source: {hours} hours ago
vi: {hours} giờ trước

# chatBotSaveAll
source: Save all
vi: Lưu tất cả

# chatBotSave
source: Save
vi: Lưu

# chatBotAddedAllToList
source: Added {count} dishes to list
vi: Đã thêm {count} món vào danh sách

# chatBotAddedToList
source: Added "{name}" to list
vi: Đã thêm "{name}" vào danh sách

# profileTitle
source: Profile
vi: Hồ sơ

# profileUser
source: User
vi: Người dùng

# profileAvatarUpdated
source: Avatar updated
vi: Đã cập nhật ảnh đại diện

# profileCannotUpdateAvatar
source: Cannot update avatar
vi: Không thể cập nhật ảnh

# profileSignedOut
source: Signed out
vi: Đã đăng xuất

# profileCannotSignOut
source: Cannot sign out
vi: Không thể đăng xuất

# profileEditProfile
source: Edit profile
vi: Chỉnh sửa hồ sơ

# profileViewStatistics
source: View statistics
vi: Xem báo cáo thống kê

# profileSettings
source: Settings
vi: Cài đặt

# profileDataAndSync
source: Data and sync
vi: Dữ liệu và đồng bộ

# profileSupport
source: Support
vi: Hỗ trợ

# profileSignOut
source: Sign out
vi: Đăng xuất

# profileSignIn
source: Sign in
vi: Đăng nhập

# profileFeatureInDevelopment
source: Feature in development
vi: Tính năng đang phát triển

# profileAppDescription
source: Smart diet management app
vi: Ứng dụng quản lý chế độ ăn uống thông minh

# editProfileTitle
source: Edit profile
vi: Chỉnh sửa hồ sơ

# editProfileSave
source: Save
vi: Lưu

# editProfileUpdated
source: Profile updated
vi: Đã cập nhật hồ sơ

# editProfileError
source: Error
vi: Lỗi

# editProfilePersonalInfo
source: Personal information
vi: Thông tin cá nhân

# editProfileFullName
source: Full name
vi: Họ và tên

# editProfilePleaseEnterFullName
source: Please enter full name
vi: Vui lòng nhập họ tên

# editProfileAge
source: Age
vi: Tuổi

# editProfilePleaseEnterAge
source: Please enter age
vi: Vui lòng nhập tuổi

# editProfileInvalidAge
source: Invalid age
vi: Tuổi không hợp lệ

# editProfileGender
source: Gender
vi: Giới tính

# editProfileMale
source: Male
vi: Nam

# editProfileFemale
source: Female
vi: Nữ

# editProfileBodyMetrics
source: Body metrics
vi: Thông số cơ thể

# editProfileHeight
source: Height (cm)
vi: Chiều cao (cm)

# editProfileInvalidHeight
source: Invalid height
vi: Chiều cao không hợp lệ

# editProfileWeight
source: Weight (kg)
vi: Cân nặng (kg)

# editProfileInvalidWeight
source: Invalid weight
vi: Cân nặng không hợp lệ

# editProfileGoalWeight
source: Goal weight (kg)
vi: Mục tiêu cân nặng (kg)

# editProfileInvalidGoalWeight
source: Invalid goal weight
vi: Mục tiêu cân nặng không hợp lệ

# editProfileYourGoal
source: Your goal
vi: Mục tiêu của bạn

# editProfileSelectGoal
source: Select goal
vi: Chọn mục tiêu

# editProfileGoalLoseWeight
source: Lose weight
vi: Giảm cân

# editProfileGoalGainWeight
source: Gain weight
vi: Tăng cân

# editProfileGoalMaintainWeight
source: Maintain weight
vi: Duy trì cân nặng

# editProfileGoalBuildMuscle
source: Build muscle
vi: Tăng cơ

# settingsTitle
source: Settings
vi: Cài đặt

# settingsNotifications
source: Notifications
vi: Thông báo

# settingsNotificationTitle
source: Notifications
vi: Thông báo

# settingsNotificationSubtitle
source: Receive notifications about meals and goals
vi: Nhận thông báo về bữa ăn và mục tiêu

# settingsAppearance
source: Appearance
vi: Giao diện

# settingsDarkMode
source: Dark mode
vi: Chế độ tối

# settingsDarkModeSubtitle
source: Use dark theme
vi: Sử dụng giao diện tối

# settingsDarkModeEnabled
source: Switched to dark mode
vi: Đã chuyển sang chế độ tối

# settingsDarkModeDisabled
source: Switched to light mode
vi: Đã chuyển sang chế độ sáng

# settingsLanguage
source: Language
vi: Ngôn ngữ

# settingsUnits
source: Units
vi: Đơn vị đo lường

# settingsUnitSystem
source: Unit system
vi: Hệ đo lường

# dataSyncTitle
source: Data & Sync
vi: Dữ liệu & Đồng bộ

# dataSyncAutoSync
source: Auto sync
vi: Tự động đồng bộ

# dataSyncAutoSyncSubtitle
source: Sync data automatically with cloud
vi: Đồng bộ dữ liệu tự động với cloud

# dataSyncBackupData
source: Backup data
vi: Sao lưu dữ liệu

# dataSyncBackupDataSubtitle
source: Backup your data
vi: Sao lưu dữ liệu của bạn

# dataSyncBackupDialogTitle
source: Backup data
vi: Sao lưu dữ liệu

# dataSyncBackupDialogMessage
source: Do you want to backup your data to the cloud?
vi: Bạn có muốn sao lưu dữ liệu của mình lên cloud không?

# dataSyncBackupDialogCancel
source: Cancel
vi: Hủy

# dataSyncBackupDialogConfirm
source: Backup
vi: Sao lưu

# dataSyncBackupInProgress
source: Backing up data...
vi: Đang sao lưu dữ liệu...

# dataSyncClearCache
source: Clear cache
vi: Xóa cache

# dataSyncClearCacheSubtitle
source: Clear temporary data
vi: Xóa dữ liệu tạm thời

# dataSyncClearCacheDialogTitle
source: Clear cache
vi: Xóa cache

# dataSyncClearCacheDialogMessage
source: Clearing cache will free up storage but may slow down the app on next launch. Are you sure you want to clear?
vi: Việc xóa cache sẽ giải phóng dung lượng nhưng có thể làm ứng dụng chậm hơn trong lần mở tiếp theo. Bạn có chắc chắn muốn xóa?

# dataSyncClearCacheDialogCancel
source: Cancel
vi: Hủy

# dataSyncClearCacheDialogConfirm
source: Clear
vi: Xóa

# dataSyncClearCacheSuccess
source: Cache cleared successfully
vi: Đã xóa cache thành công

# supportTitle
source: Support
vi: Hỗ trợ

# supportPrivacyPolicy
source: Privacy policy
vi: Chính sách bảo mật

# supportOpeningPrivacyPolicy
source: Opening privacy policy...
vi: Đang mở chính sách bảo mật...

# supportTermsOfService
source: Terms of service
vi: Điều khoản sử dụng

# supportOpeningTermsOfService
source: Opening terms of service...
vi: Đang mở điều khoản sử dụng...

# supportRecommendationSources
source: Recommendation sources
vi: Nguồn khuyến nghị

# supportOpeningRecommendationSources
source: Opening recommendation sources...
vi: Đang mở nguồn khuyến nghị...

# supportFindVGPOnSocialMedia
source: Find VGP on social media
vi: Tìm VGP trên trang mạng xã hội

# supportOpeningTiktok
source: Opening TikTok...
vi: Đang mở TikTok...

# supportOpeningFacebook
source: Opening Facebook...
vi: Đang mở Facebook...

# supportOpeningInstagram
source: Opening Instagram...
vi: Đang mở Instagram...

# supportHelpCenter
source: Help center
vi: Trung tâm hỗ trợ

# supportAlwaysHereToHelp
source: We are always here to help
vi: Chúng tôi luôn sẵn sàng giúp đỡ

# helpCenterTitle
source: Help center
vi: Trung tâm hỗ trợ

# helpCenterWeAreReadyToHelp
source: We are ready to help
vi: Chúng tôi sẵn sàng hỗ trợ

# helpCenterFindAnswersOrContact
source: Find answers or contact the team
vi: Tìm câu trả lời hoặc liên hệ với team

# helpCenterFAQ
source: Frequently asked questions
vi: Câu hỏi thường gặp

# helpCenterContactUs
source: Contact us
vi: Liên hệ với chúng tôi

# helpCenterFAQ1Question
source: How to track nutrition?
vi: Làm thế nào để theo dõi dinh dưỡng?

# helpCenterFAQ1Answer
source: You can add food to your daily meal diary. The app will automatically calculate nutrition for you.
vi: Bạn có thể thêm thực phẩm vào nhật ký bữa ăn hàng ngày. Ứng dụng sẽ tự động tính toán dinh dưỡng cho bạn.

# helpCenterFAQ2Question
source: Can I set calorie goals?
vi: Tôi có thể đặt mục tiêu calo không?

# helpCenterFAQ2Answer
source: Yes, you can set calorie goals and other nutrition metrics in the Goal Settings section.
vi: Có, bạn có thể đặt mục tiêu calo và các chỉ số dinh dưỡng khác trong phần Cài đặt Mục tiêu.

# helpCenterFAQ3Question
source: How to create a menu?
vi: Làm sao để tạo thực đơn?
