Repository: IvanK04/Diet-Tracking-Project-Finalist-Hutech-IT-Got-Talent
Catalog: lib/l10n/app_*.arb
Languages: vi

# helpCenterFAQ3Answer
source: Go to the Menu section, select "Create new" and add the dishes you want. The app will automatically calculate nutrition.
vi: Vào phần Thực đơn, chọn "Tạo mới" và thêm các món ăn bạn muốn. Ứng dụng sẽ tính toán dinh dưỡng tự động.

# helpCenterFAQ4Question
source: Is my data synchronized?
vi: Dữ liệu của tôi có được đồng bộ không?

# helpCenterFAQ4Answer
source: Yes, data is automatically synchronized with cloud if you are logged in to an account.
vi: Có, dữ liệu được tự động đồng bộ với cloud nếu bạn đã đăng nhập tài khoản.

# helpCenterFAQ5Question
source: How to export reports?
vi: Làm sao để xuất báo cáo?

# helpCenterFAQ5Answer
source: Go to the Report section, select a time period and press the "Export PDF" button to download the report to your device.
vi: Vào phần Báo cáo, chọn khoảng thời gian và nhấn nút "Xuất PDF" để tải báo cáo về máy.

# helpCenterContactPhone
source: Phone
vi: Số điện thoại

# helpCenterContactAddress
source: Address
vi: Địa chỉ

# helpCenterContactAddressValue
source: 123 Main Street, District 1, Ho Chi Minh City
vi: 123 Đường Chính, Quận 1, TP. Hồ Chí Minh

source: Monday
vi: Thứ Hai

source: Tuesday
vi: Thứ Ba

source: Wednesday
vi: Thứ Tư

source: Thursday
vi: Thứ Năm

source: Friday
vi: Thứ Sáu

source: Saturday
vi: Thứ Bảy

source: Sunday
vi: Chủ Nhật

# bottomNavHome
source: Home
vi: Trang chủ

# bottomNavRecord
source: Record
vi: Ghi nhận

# bottomNavProfile
source: Profile
vi: Hồ sơ

# bottomNavScanFood
source: Scan food
vi: Quét món ăn

# bottomNavReport
source: Report
vi: Báo cáo

# searchHint
source: Search
vi: Tìm kiếm

# calorieCardBurnedToday
source: Your calories burned today
vi: Lượng calo đã đốt hôm nay

# nutrientFiber
source: Fiber
vi: Chất xơ

# nutrientCarbs
source: Carbs
vi: Tinh bột

# calorieCardCaloriesTaken
source: Calories taken
vi: Calo đã nạp

# calorieCardViewReport
source: View report
vi: Xem báo cáo

# notificationTitle
source: Notifications
vi: Thông báo

# waterReminderTitle
source: Water Reminder
vi: Nhắc nhở uống nước

# waterReminderMessage
source: Drink enough water every day to keep your body healthy and energized!
vi: Uống đủ nước mỗi ngày giúp cơ thể khỏe mạnh và duy trì năng lượng!

source: Mark all as read
vi: Đọc tất cả

# noNotifications
source: No notifications yet
vi: Chưa có thông báo nào

# recordPageTitle
source: Record Meals
vi: Ghi nhận món ăn

# recordedMealsTitle
source: Recorded Meals
vi: Món ăn đã ghi nhận

# retryButton
source: Retry
vi: Thử lại

# noMealsRecorded
source: No meals recorded yet
vi: Chưa có món ăn nào được ghi nhận

# addFirstMeal
source: Add your first meal!
vi: Hãy thêm món ăn đầu tiên của bạn!

# nutritionInfo
source: Nutrition Information
vi: Thông tin dinh dưỡng

# foodScannerTitle
source: Food scanner
vi: Quét món ăn

# foodScannerSubtitle
source: Align the product inside the frame
vi: Căn chỉnh sản phẩm trong khung

# foodScannerOverlayAutoDetect
source: Auto detecting...
vi: Đang tự động nhận diện...

# foodScannerOverlayBarcodeHint
source: Align barcode inside the frame
vi: Căn mã vạch trong khung

# foodScannerActionFood
source: Scan food
vi: Quét món ăn

# foodScannerActionBarcode
source: Barcode
vi: Mã vạch

# foodScannerActionGallery
source: Gallery
vi: Thư viện

# foodScannerHelpTitle
source: How to scan
vi: Cách quét

# foodScannerHelpTip1
source: Place the meal fully inside the frame.
vi: Đặt món ăn nằm gọn trong khung.

# foodScannerHelpTip2
source: Use the Barcode mode for packaged products.
vi: Dùng chế độ Mã vạch cho sản phẩm đóng gói.

# foodScannerHelpTip3
source: Pick from Gallery to reuse saved photos.
vi: Chọn từ Thư viện để dùng lại ảnh đã chụp.

# foodScannerGalleryTitle
source: Pick from gallery
vi: Chọn từ thư viện

# foodScannerGallerySubtitle
source: Select a previously captured meal photo.
vi: Chọn ảnh món ăn đã chụp trước đó.

# foodScannerGalleryButton
source: Open gallery
vi: Mở thư viện

# foodScannerPlaceholderCaptureFood
source: Capturing food photo (coming soon)
vi: Đang lưu ảnh món ăn

# foodScannerPlaceholderScanBarcode
source: Scanning barcode (coming soon)
vi: Đang quét mã vạch (sắp ra mắt)

# foodScannerPlaceholderOpenGallery
source: Opening gallery (coming soon)
vi: Đang mở thư viện (sắp ra mắt)

# recentlyLoggedTitle
source: Recently logged
vi: Đã ghi nhận gần đây

# recentlyLoggedSubtitle
source: Start tracking your meals by taking a quick picture
vi: Bắt đầu theo dõi bữa ăn bằng cách chụp ảnh nhanh

# recentlyLoggedEmpty
source: You haven't uploaded any food
vi: Bạn chưa tải lên bất kỳ món ăn nào

source: View all
vi: Xem tất cả

source: Delete
vi: Xóa

source: Cancel
vi: Hủy

source: Delete Photo
vi: Xóa ảnh

# deletePhotoConfirmation
source: Are you sure you want to delete this photo?
vi: Bạn có chắc chắn muốn xóa ảnh này không?

# photoDeletedSuccessfully
source: Deleted successfully
vi: Xóa thành công

source: Analyze Food
vi: Phân tích món ăn

# shareFunctionality
source: Share functionality coming soon
vi: Tính năng chia sẻ sắp ra mắt

# aiFoodAnalysis
source: AI food analysis coming soon
vi: Phân tích món ăn bằng AI sắp ra mắt

# permissionCameraRequired
source: Please grant camera access to use this feature.
vi: Vui lòng cấp quyền truy cập máy ảnh để sử dụng tính năng này.

# inboxTitle
source: Inbox
vi: Hộp thư đến

# searchHintText
source: Search
vi: Tìm kiếm

# filterTitle
source: Filter
vi: Bộ lọc

source: Category
vi: Danh mục

source: All
vi: Tất cả

source: Breakfast
vi: Sáng

source: Lunch
vi: Trưa

source: Dinner
vi: Tối

source: Snack
vi: Phụ

# calorieRangeLabel
source: Calorie range
vi: Khoảng calo

source: Reset
vi: Đặt lại

# mealsListTitle
source: Meals list
vi: Danh sách bữa ăn

source: No meals yet
vi: Chưa có bữa ăn nào

# startByScanningOrPhoto
source: Scan a barcode or take a photo to get started
vi: Quét barcode hoặc chụp ảnh món ăn để bắt đầu

# deleteMealTooltip
source: Delete meal
vi: Xoá món ăn

# deleteMealTitle
source: Delete meal?
vi: Xoá món ăn?

# deleteMealMessage
source: Are you sure you want to delete "{foodName}" from records?
vi: Bạn có chắc muốn xoá "{foodName}" khỏi ghi nhận?

source: Initializing...
vi: Đang khởi tạo...

source: Selected Food
vi: Món ăn đã chọn

# snackbarSuccessTitle
source: Success
vi: Thành công

# snackbarErrorTitle
source: Error
vi: Lỗi

# snackbarWarningTitle
source: Warning
vi: Cảnh báo

# snackbarInfoTitle
source: Info
vi: Thông tin

# foodScannerCantCapturePhoto
source: Couldn't capture photo, please try again.
vi: Không thể chụp ảnh, vui lòng thử lại.

# foodScannerCantOpenGallery
source: Couldn't open gallery, please try again.
vi: Không thể mở thư viện, vui lòng thử lại.

# foodScannerNoBarcodeFoundSaving
source: No barcode found in image. Saving photo...
vi: Không tìm thấy mã trong ảnh. Đang lưu ảnh...

# foodScannerNoCamera
source: No camera found on device.
vi: Không tìm thấy camera trên thiết bị.

# foodScannerSavePhotoSuccess
source: Photo saved successfully
vi: Đã lưu ảnh thành công

# foodScannerUploadError
source: Couldn't upload photo to Cloudinary. Please try again.
vi: Không thể tải ảnh lên Cloudinary. Vui lòng thử lại.

# foodScannerSavePhotoError
source: Saved photo (error looking up info)
vi: Đã lưu ảnh (lỗi khi tra cứu thông tin)

# foodScannerSavedBarcodeNoDetail
source: Saved code: {barcodeValue} (Details not found)
vi: Đã lưu mã: {barcodeValue} (Không tìm thấy chi tiết)

# foodScannerCameraNotReady
source: Camera not ready
vi: Camera chưa sẵn sàng

# foodScannerBarcodeError
source: Error scanning barcode
vi: Lỗi khi quét barcode

# foodScannerProductDefaultName
source: Product {barcode}
vi: Sản phẩm {barcode}

# foodScannerScanned
source: Scanned: {foodName}
vi: Đã quét: {foodName}

# foodScannerSaveProductError
source: Error saving product
vi: Lỗi khi lưu sản phẩm

source: Meal deleted successfully
vi: Xoá món ăn thành công

# deleteMealFailed
source: Failed to delete meal
vi: Xoá món ăn thất bại

# sourceTagBotSuggestion
source: Chatbot suggestion
vi: Gợi ý Chatbot

# sourceTagScanned
source: From scan/photo
vi: Từ quét ảnh/mã

# sourceTagManual
source: Manual input
vi: Nhập thủ công
